app/views/users/_users.html.erb

<h5>Team Members:</h5>
<% @team.users.each do |user| %>
---
SELECT "users".* FROM "users" WHERE "users"."team_id" = ?  [["team_id", 1]]