app/controllers/teams_controller.rb

    def about
        @teams=Team.all
---
SELECT "teams".* FROM "teams"

    def create
        @team = Team.new(team_params)
        @team.save
---
INSERT INTO "teams" ("name", "created_at", "updated_at") VALUES (?, ?, ?)  [["name", "History Project"], ["created_at", "2020-09-10 21:52:22.202733"], ["updated_at", "2020-09-10 21:52:22.202733"]]