app/controllers/timelines_controller.rb

    def create
        @team = Team.find(params[:team_id])
        @timeline = @team.create_timeline(timeline_params)
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
INSERT INTO "timelines" ("numMilestone", "date", "team_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["numMilestone", "4"], ["date", "2020-09-23"], ["team_id", 3], ["created_at", "2020-09-11 19:51:01.765425"], ["updated_at", "2020-09-11 19:51:01.765425"]]

    def show
        @timeline=Timeline.find(params[:team_id])
        @team = Team.find(params[:team_id])
---
SELECT "timelines".* FROM "timelines" WHERE "timelines"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

    def new
        @team = Team.find(params[:team_id])
---
SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]