app/controllers/users_controller.rb

SELECT "teams".* FROM "teams" WHERE "teams"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
INSERT INTO "users" ("name", "email", "role", "team_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Ron"], ["email", "ron@hogwarts.edu"], ["role", "Facilitator"], ["team_id", 1], ["created_at", "2020-09-10 22:15:24.114481"], ["updated_at", "2020-09-10 22:15:24.114481"]]
---
    def create
        @team = Team.find(params[:team_id])
        @user = @team.users.create(user_params)